<a href="https://colab.research.google.com/github/smiledinisa/data_python_analysis/blob/master/pandas004_DataWrangling.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# CAHPER 8 : Data Wrangling : Join, Combine and Reshape

In [1]:
import numpy as np
from pandas import Series as Series
from pandas import DataFrame as DataFrame

## Hirerarchical Indexing


hirearchial indexing is used extensively in some of the manipulations.

provides a way for you to work with higher dimenssion data in a lower 
dimenssion form.

用处广泛，以低维的方法处理高维的数据提供了便利。

In [2]:
data = Series(np.random.randn(9), index = [['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'],
                        [1, 2, 3, 1, 3, 1, 2, 2, 3]])


data

a  1   -0.385981
   2   -0.229669
   3   -0.761870
b  1   -2.670295
   3   -0.794319
c  1   -0.252197
   2   -0.691085
d  2    0.385599
   3    0.277716
dtype: float64

In [ ]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

In [ ]:
#With a hierarchically indexed object, so-called partial indexing is possible, enabling
# you to concisely select subsets of the data:
# 分层索引使得局部索引成为可能。

data['b']

1    0.298517
3    0.591261
dtype: float64

In [ ]:
data['b':'c']

b  1    0.298517
   3    0.591261
c  1   -1.047802
   2    0.354460
dtype: float64

In [ ]:
data.loc[['b','c']]

b  1    0.298517
   3    0.591261
c  1   -1.047802
   2    0.354460
dtype: float64

In [ ]:
data.loc[:,2]

a   -0.524601
c    0.354460
d    1.079982
dtype: float64

In [ ]:
# 多层索引的unstack 方法b
 
data.unstack()

          1         2         3
a  1.284930 -0.524601  1.520868
b  0.298517       NaN  0.591261
c -1.047802  0.354460       NaN
d       NaN  1.079982 -1.187737

In [ ]:
# inverse operation of unstack is stack.
data.unstack().stack()

a  1    1.284930
   2   -0.524601
   3    1.520868
b  1    0.298517
   3    0.591261
c  1   -1.047802
   2    0.354460
d  2    1.079982
   3   -1.187737
dtype: float64

With a DataFrame, either axis can have a hierarchical index:

各个轴都可以由 多层索引。

In [ ]:
frame = DataFrame(np.arange(12).reshape((4, 3)),
          index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
          columns=[['Ohio', 'Ohio', 'Colorado'],
          ['Green', 'Red', 'Green']])
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [ ]:
frame.index.names

FrozenList([None, None])

In [ ]:
frame.columns.names

FrozenList([None, None])

In [ ]:
# hierarchical levels can have names


frame.index.names = ['key1', 'key2']
frame.columns.names = ['state', 'color']

In [ ]:
print(frame.index.names)
print(frame.columns.names)

['key1', 'key2']
['state', 'color']

In [ ]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [ ]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [ ]:
frame['Ohio'].loc['a'] # 可以组合使用。

color  Green  Red
key2
1          0    1
2          3    4

In [ ]:
# A  MultiIndex can be created by itself and then reused; the columns in the preceding
# DataFrame with level names could be created like this:
import pandas as pd
mul_col = pd.MultiIndex.from_arrays([['Ohio', 'Ohio','Colorado'], ['green','red','green']], names = ['state', 'color'])

In [ ]:
x = DataFrame(np.arange(12).reshape((4, 3)),
          index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
          columns=mul_col)
x

state  Ohio     Colorado
color green red    green
a 1       0   1        2
  2       3   4        5
b 1       6   7        8
  2       9  10       11

### Reordering and Sorting Levels


At times we need to rearrange the order of the levels.

有时候我们需要对索引的级别重新排列。


keyward: ***swaplevel***.

In [ ]:
x

state  Ohio     Colorado
color green red    green
a 1       0   1        2
  2       3   4        5
b 1       6   7        8
  2       9  10       11

In [ ]:
x.swaplevel('state','color',axis=1)

color green  red    green
state  Ohio Ohio Colorado
a 1       0    1        2
  2       3    4        5
b 1       6    7        8
  2       9   10       11

In [ ]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [ ]:
frame.swaplevel('key1','key2',axis=0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [ ]:
# 我们对dataframe的value进行排序，按某一个index或者axis

frame.sort_index(level=1,axis=0,ascending=True, inplace= False, kind='quicksort')

# 除了level 其他参数都是默认的。 方便我们进行控制。

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [ ]:
frame.sort_index(level=0,axis=0,ascending=True, inplace= False, kind='quicksort')

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [ ]:
frame.swaplevel(0,1).sort_index(level = 0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

### Summary Statistics by Level

按索引级别的分层概要统计。

In [ ]:
# 一般来说，统计function都是含有level选项参数的。
frame.sum(level='key2')

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [ ]:
frame.sum(level= 'color', axis= 1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

### Indexing with a DataFrame's columns

It’s not unusual to want to use one or more columns from a DataFrame as the row
index; alternatively, you may wish to **move the row index into the DataFrame**’s col‐
umns. Here’s an example DataFrame:

keyward: ***set_index,reset_index***

想将index 转换为行，或者将columns转换为index

In [ ]:
import pandas as pd
import numpy as np
from pandas import DataFrame
from pandas import Series

frame = pd.DataFrame({'a': range(7), 'b': range(7, 0, -1),
            'c': ['one', 'one', 'one', 'two', 'two',
            'two', 'two'],
            'd': [0, 1, 2, 0, 1, 2, 3]})

In [ ]:
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [ ]:
# set_index.

frame2 = frame.set_index(['c'])
frame2

     a  b  d
c
one  0  7  0
one  1  6  1
one  2  5  2
two  3  4  0
two  4  3  1
two  5  2  2
two  6  1  3

In [ ]:
frame2 = frame.set_index(['c','d'])
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [ ]:
# default,drop the columns we changged. but if want to leave them :

frame3 = frame.set_index(['c','d'], drop=False)
frame3

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [ ]:
# keyward : reset_index:

frame4 = frame2.reset_index() # 默认会将全部的index转换成columns ,but we can specify the index.
frame4

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

In [ ]:
frame4 = frame2.reset_index(level=1, drop= False) 
frame4

     d  a  b
c
one  0  0  7
one  1  1  6
one  2  2  5
two  0  3  4
two  1  4  3
two  2  5  2
two  3  6  1

## Combining and Merging Datasets



1.   ***pandas.merge*** : like database join. connects rows in DataFrame based on keys.

2.   ***pandas.concat*** : concatenates or 'stacks' along an axis.

3.   ***combine_first*** : splicing together overlapping data to fill in missing values in one object with values from another.




链接方法how= 可用的关键字。
---
![链接文字](https://img-blog.csdnimg.cn/20200816104752960.png?x-oss-process=image/watermark,type_ZmFuZ3poZW5naGVpdGk,shadow_10,text_aHR0cHM6Ly9ibG9nLmNzZG4ubmV0L2dhb2N1aTg4Mw==,size_16,color_FFFFFF,t_70#pic_center)
---
---

![链接文字](https://img-blog.csdnimg.cn/20200816112055826.png?x-oss-process=image/watermark,type_ZmFuZ3poZW5naGVpdGk,shadow_10,text_aHR0cHM6Ly9ibG9nLmNzZG4ubmV0L2dhb2N1aTg4Mw==,size_16,color_FFFFFF,t_70#pic_center)
---

### Database-Style DataFrame Joins

In [ ]:
# merge 

df1 = DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
          'data1': range(7)})
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [ ]:
df2 = pd.DataFrame({'key': ['a', 'b', 'd'],
          'data2': range(3)})
df2

  key  data2
0   a      0
1   b      1
2   d      2

In [ ]:
pd.merge(df1,df2)  # 默认对相同的名字的coloumn进行链接。

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [ ]:
# 也可对链接的名进行指定。
pd.merge(df1,df2, on= 'key')

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [ ]:
# 如果两个dataframe名有相同的列明的话。

df3 = pd.DataFrame({'lkey': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
            'data1': range(7)})

df4 = pd.DataFrame({'rkey': ['a', 'b', 'd'],
            'data2': range(3)})
print(df3)
print(df4)

  lkey  data1
0    b      0
1    b      1
2    a      2
3    c      3
4    a      4
5    a      5
6    b      6
  rkey  data2
0    a      0
1    b      1
2    d      2

In [ ]:
pd.merge(df3,df4, left_on='lkey',right_on='rkey', how = 'inner')

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      1    b      1
2    b      6    b      1
3    a      2    a      0
4    a      4    a      0
5    a      5    a      0

In [ ]:
pd.merge(df4,df3, left_on='rkey',right_on='lkey', how = 'inner')

  rkey  data2 lkey  data1
0    a      0    a      2
1    a      0    a      4
2    a      0    a      5
3    b      1    b      0
4    b      1    b      1
5    b      1    b      6

In [ ]:
# by default, how = 'inner', but we can specify the keyward: left,right,outer. 
# they are all like method in sql.

pd.merge(df3,df4, left_on='lkey',right_on='rkey', how='left')

  lkey  data1 rkey  data2
0    b      0    b    1.0
1    b      1    b    1.0
2    a      2    a    0.0
3    c      3  NaN    NaN
4    a      4    a    0.0
5    a      5    a    0.0
6    b      6    b    1.0

In [ ]:
pd.merge(df3,df4, left_on='lkey',right_on='rkey', how='right')

  lkey  data1 rkey  data2
0    b    0.0    b      1
1    b    1.0    b      1
2    b    6.0    b      1
3    a    2.0    a      0
4    a    4.0    a      0
5    a    5.0    a      0
6  NaN    NaN    d      2

In [ ]:
pd.merge(df3,df4, left_on='lkey',right_on='rkey', how='outer')

  lkey  data1 rkey  data2
0    b    0.0    b    1.0
1    b    1.0    b    1.0
2    b    6.0    b    1.0
3    a    2.0    a    0.0
4    a    4.0    a    0.0
5    a    5.0    a    0.0
6    c    3.0  NaN    NaN
7  NaN    NaN    d    2.0

In [ ]:
# multiple keys. pass a list of column names:

left = DataFrame({'key1': ['foo', 'foo', 'bar'],
          'key2': ['one', 'two', 'one'],
          'lval': [1, 2, 3]})
right = DataFrame({'key1': ['foo', 'foo', 'bar', 'bar'],
            'key2': ['one', 'one', 'one', 'two'],
            'rval': [4, 5, 6, 7]})

print(left)
print(right)

  key1 key2  lval
0  foo  one     1
1  foo  two     2
2  bar  one     3
  key1 key2  rval
0  foo  one     4
1  foo  one     5
2  bar  one     6
3  bar  two     7

In [ ]:
pd.merge(left,right, how='outer', on=['key1', 'key2'])

  key1 key2  lval  rval
0  foo  one   1.0   4.0
1  foo  one   1.0   5.0
2  foo  two   2.0   NaN
3  bar  one   3.0   6.0
4  bar  two   NaN   7.0

In [ ]:
# if we only merge on the key1:

In [ ]:
pd.merge(left,right, how='outer', on=['key1'])

  key1 key2_x  lval key2_y  rval
0  foo    one     1    one     4
1  foo    one     1    one     5
2  foo    two     2    one     4
3  foo    two     2    one     5
4  bar    one     3    one     6
5  bar    one     3    two     7

In [ ]:
# we can see that key2'name changged : by default the columns didnt merge,but have the same columnname ,will 
# change _x at left, _y at the right.

# but we can change this by set the option keyward: suffixes = ('chars we want set.')

pd.merge(left,right, how='outer', on=['key1'], suffixes=('_mother', '_dady'))

  key1 key2_mother  lval key2_dady  rval
0  foo         one     1       one     4
1  foo         one     1       one     5
2  foo         two     2       one     4
3  foo         two     2       one     5
4  bar         one     3       one     6
5  bar         one     3       two     7

### Merging on Index

In some cases, the merge key(s) in a DataFrame will be found in its index. In this
case, you can pass  **left_index=True** or  **right_index=True** (or both) to indicate that
the index should be used as the merge key:


很多情况下，我们并不是以列来对dataframe进行链接，而是以index作为key来对dataframe进行链接的，这种情况下需要指定 

merge的option参数： l**eft_index = TRUE**,和**right_index = true.**

In [ ]:
left1 = DataFrame({'key': ['a', 'b', 'a', 'a', 'b', 'c'],
          'value': range(6)})

right1 = DataFrame({'group_val': [3.5, 7]}, index=['a', 'b'])

print(left1)
print(right1)

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5
   group_val
a        3.5
b        7.0

In [ ]:
# 可以看出，left1 有一列名为 abac....
# 而right1 的index 则是abab。。。
# 用left1 的key与right1 的index进行链接。


pd.merge(left1,right1, left_on='key', right_on= None, left_index= False, right_index= True, how='outer')

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0
5   c      5        NaN

In [ ]:
# with hierarchically indexed data, more complicated .

# 因为是隐式的多级合并。

lefth = DataFrame({'key1': ['Ohio', 'Ohio', 'Ohio',
'Nevada', 'Nevada'],
'key2': [2000, 2001, 2002, 2001, 2002],
'data': np.arange(5.)})

righth = pd.DataFrame(np.arange(12).reshape((6, 2)),
index=[['Nevada', 'Nevada', 'Ohio', 'Ohio',
'Ohio', 'Ohio'],
[2001, 2000, 2000, 2000, 2001, 2002]],
columns=['event1', 'event2'])

lefth

     key1  key2  data
0    Ohio  2000   0.0
1    Ohio  2001   1.0
2    Ohio  2002   2.0
3  Nevada  2001   3.0
4  Nevada  2002   4.0

In [ ]:
righth

             event1  event2
Nevada 2001       0       1
       2000       2       3
Ohio   2000       4       5
       2000       6       7
       2001       8       9
       2002      10      11

In [ ]:
# 其实就是组合索引的链接。本来没有出现的组合，并不会重新出现。
pd.merge(lefth, righth, left_on=['key1', 'key2'], right_index= True, how='inner')

     key1  key2  data  event1  event2
0    Ohio  2000   0.0     4.0     5.0
0    Ohio  2000   0.0     6.0     7.0
1    Ohio  2001   1.0     8.0     9.0
2    Ohio  2002   2.0    10.0    11.0
3  Nevada  2001   3.0     0.0     1.0
4  Nevada  2002   4.0     NaN     NaN
4  Nevada  2000   NaN     2.0     3.0

In [ ]:
pd.merge(lefth, righth, left_on=['key1', 'key2'], right_index= True, how='outer')

     key1  key2  data  event1  event2
0    Ohio  2000   0.0     4.0     5.0
0    Ohio  2000   0.0     6.0     7.0
1    Ohio  2001   1.0     8.0     9.0
2    Ohio  2002   2.0    10.0    11.0
3  Nevada  2001   3.0     0.0     1.0
4  Nevada  2002   4.0     NaN     NaN
4  Nevada  2000   NaN     2.0     3.0

In [ ]:
# 两边的索引都用，也是可以的。
left2 = pd.DataFrame([[1., 2.], [3., 4.], [5., 6.]],
            index=['a', 'c', 'e'],
            columns=['Ohio', 'Nevada'])

right2 = pd.DataFrame([[7., 8.], [9., 10.], [11., 12.], [13, 14]],
            index=['b', 'c', 'd', 'e'],
            columns=['Missouri', 'Alabama'])
left2

   Ohio  Nevada
a   1.0     2.0
c   3.0     4.0
e   5.0     6.0

In [ ]:
right2

   Missouri  Alabama
b       7.0      8.0
c       9.0     10.0
d      11.0     12.0
e      13.0     14.0

In [ ]:
pd.merge(left2,right2, how='outer', left_index=True, right_index=True)

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

In [ ]:
# dataframe 还有 join方法来对index进行链接，但是要求列明没有重复的。

left2.join(right2,how='outer')

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

In [ ]:
# 当然，join也可以链接指定列名，但是默认只是进行左连接。也就是保持左边的dataframe保持不变。
left1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [ ]:
right1

   group_val
a        3.5
b        7.0

In [ ]:
left1.join(right1, on='key')

  key  value  group_val
0   a      0        3.5
1   b      1        7.0
2   a      2        3.5
3   a      3        3.5
4   b      4        7.0
5   c      5        NaN

In [ ]:
another = pd.DataFrame([[7., 8.], [9., 10.], [11., 12.], [16., 17.]],
              index=['a', 'c', 'e', 'f'],
              columns=['New York', 'Oregon'])

# 多列表链接, 直接传一个dataframe列表。

left2.join([right2,another], how='outer')

   Ohio  Nevada  Missouri  Alabama  New York  Oregon
a   1.0     2.0       NaN      NaN       7.0     8.0
c   3.0     4.0       9.0     10.0       9.0    10.0
e   5.0     6.0      13.0     14.0      11.0    12.0
b   NaN     NaN       7.0      8.0       NaN     NaN
d   NaN     NaN      11.0     12.0       NaN     NaN
f   NaN     NaN       NaN      NaN      16.0    17.0

###### 2020.8.17

### Concatenating Along an Axis

Another kind of data combination operation is referred to interchangeably as concat‐
enation, binding, or stacking. NumPy’s  concatenate function can do this with
NumPy arrays:

![链接文字](https://img-blog.csdnimg.cn/20200817093333557.png?x-oss-process=image/watermark,type_ZmFuZ3poZW5naGVpdGk,shadow_10,text_aHR0cHM6Ly9ibG9nLmNzZG4ubmV0L2dhb2N1aTg4Mw==,size_16,color_FFFFFF,t_70#pic_center)


![链接文字](https://img-blog.csdnimg.cn/20200817093342932.png?x-oss-process=image/watermark,type_ZmFuZ3poZW5naGVpdGk,shadow_10,text_aHR0cHM6Ly9ibG9nLmNzZG4ubmV0L2dhb2N1aTg4Mw==,size_16,color_FFFFFF,t_70#pic_center)

In [3]:
arr = np.arange(12).reshape((3,4))
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [4]:
np.concatenate([arr,arr],axis =1)

array([[ 0,  1,  2,  3,  0,  1,  2,  3],
       [ 4,  5,  6,  7,  4,  5,  6,  7],
       [ 8,  9, 10, 11,  8,  9, 10, 11]])

In [ ]:
# 三个问题：
# 1. If the objects are indexed differently on the other axes, should we combine the
# distinct elements in these axes or use only the shared values (the intersection)?
# 如果对象在其他轴上的索引不同，我们应该在这些轴上组合不同的元素还是只是使用交集。

# 2。 Do the concatenated chunks of data need to be identifiable in the resulting
# object?
# 需要在结果中标记链接的数据块的来源吗？

# 3.  Does the “concatenation axis” contain data that needs to be preserved? In many
# cases, the default integer labels in a DataFrame are best discarded during
# concatenation.
# 链接轴是否包含需要保留的数据，数据帧中的默认整数标签最好在链接期间丢弃。（重新设定names of labels.）

In [6]:
# inner,outer，来解决第一个问题。
s1 = Series([0,1], index=['a', 'b'])
s2 = Series([2,3,4], index=['c','d','e'])
s3 = Series([5,6], index=['f','g'])



import pandas as pd

pd.concat([s1,s2,s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [7]:
# by defalut, the concat axis = 0, but we can specify it:

pd.concat([s1,s2,s3], axis=1)

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [8]:
# we can see that some of NAN value
# 我们可以看到上述链接并没由显示出第一个问题的解决，因为他们根本就没有overlap rows or columns.
# so we create s4 like this:

s4 = pd.concat([s1,s3])
s4

a    0
b    1
f    5
g    6
dtype: int64

In [9]:
# s4 have some overlap rows with the s1,s3

pd.concat([s1,s4],axis=1)

     0  1
a  0.0  0
b  1.0  1
f  NaN  5
g  NaN  6

In [10]:
# we can see that keep the no_overlap data, its outer join like . by defalut..
# we can set the key arg : join


# only keep the common data.

pd.concat([s1,s4], axis=1, join='inner')

   0  1
a  0  0
b  1  1

![链接文字](https://img-blog.csdnimg.cn/20200817100118978.png?x-oss-process=image/watermark,type_ZmFuZ3poZW5naGVpdGk,shadow_10,text_aHR0cHM6Ly9ibG9nLmNzZG4ubmV0L2dhb2N1aTg4Mw==,size_16,color_FFFFFF,t_70#pic_center)

In [15]:
result = pd.concat([s1, s1, s3], keys=['one','two','three']) #keys 的数量与链接源数量相同。
result

one    a    0
       b    1
two    a    0
       b    1
three  f    5
       g    6
dtype: int64

In [19]:
result.unstack() # 可以指定level,如果没有指定，那么默认将最后一个level的idnex转换成column索引。

         a    b    f    g
one    0.0  1.0  NaN  NaN
two    0.0  1.0  NaN  NaN
three  NaN  NaN  5.0  6.0

In [20]:
# 第三个问题。
# 名称问题。


df1 = pd.DataFrame(np.arange(6).reshape(3,2), index=['a','b','c'], columns=['one','two'])
df2 = pd.DataFrame(5+np.arange(4).reshape(2,2), index=['a','c'], columns=['three', 'four'])

df1

   one  two
a    0    1
b    2    3
c    4    5

In [21]:
df2

   three  four
a      5     6
c      7     8

In [22]:
pd.concat([df1,df2], axis=1, keys=['level1', 'level2'])

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

In [23]:
# 也可以传入字典，字典key 默认作为多层索引。
pd.concat({'level1':df1, 'level2':df2}, axis=1)

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

In [24]:
# we can nanme the hierarchical index.

pd.concat([df1,df2], axis=1, keys=['level1', 'level2'], names=['upper','lower'])

upper level1     level2
lower    one two  three four
a          0   1    5.0  6.0
b          2   3    NaN  NaN
c          4   5    7.0  8.0

In [25]:
# the key ward: ignore_index.

df1 = pd.DataFrame(np.random.randn(3, 4), columns=['a', 'b', 'c', 'd'])
df2 = pd.DataFrame(np.random.randn(2, 3), columns=['b', 'd', 'a'])
df1

          a         b         c         d
0 -0.612921 -0.374106 -0.653109 -0.228721
1 -0.342898 -0.167532 -1.413807  0.193528
2 -1.161274  0.231425  0.778643 -0.272143

In [26]:
df2

          b         d         a
0 -0.010545  0.994890  0.355820
1 -0.034410  0.911659 -0.746885

In [27]:
# 索引的行，不相关，但是序列号重复。

pd.concat([df1,df2])

          a         b         c         d
0 -0.612921 -0.374106 -0.653109 -0.228721
1 -0.342898 -0.167532 -1.413807  0.193528
2 -1.161274  0.231425  0.778643 -0.272143
0  0.355820 -0.010545       NaN  0.994890
1 -0.746885 -0.034410       NaN  0.911659

In [30]:
# 我们看到序列号自动重复。
pd.concat([df1,df2], ignore_index=True, axis=0, keys=['df1','df2'])

          a         b         c         d
0 -0.612921 -0.374106 -0.653109 -0.228721
1 -0.342898 -0.167532 -1.413807  0.193528
2 -1.161274  0.231425  0.778643 -0.272143
3  0.355820 -0.010545       NaN  0.994890
4 -0.746885 -0.034410       NaN  0.911659

In [ ]:
# 我们看到一个特别的情况， keys 不起作用了，这是因为 ignore_index.

### Combining Data wtih Overlap

一种情况是merge和concat无法满足的，merge是对不同或者相同的索引进行链接。（数据库的方式）

concat是对不同对象进行简单链接。（有共同特征的），而且不会改变链接对象的value的。


但是如果有种情况是，两个对象有overlap，我们想要对这些overlap进行合并（），对不重合的则不进行合并。就要改变value的值。

关键字： combine_first 类似np.where.

In [47]:
# 根据条件来进行合并。

a = Series([np.nan, 2.5, np.nan, 3.5, 4.5, np.nan], index =['f', 'e', 'd', 'c', 'b', 'a'])

b = Series(np.arange(len(a), dtype= np.float64), index=['f', 'e', 'd', 'c', 'b', 'a'])

# b[-1] = np.nan

# a
a

f    NaN
e    2.5
d    NaN
c    3.5
b    4.5
a    NaN
dtype: float64

In [48]:
b

f    0.0
e    1.0
d    2.0
c    3.0
b    4.0
a    5.0
dtype: float64

In [50]:
np.where(pd.isnull(a), b, a)  # pd.isnull 是条件，真选b，假选a

array([0. , 2.5, 2. , 3.5, 4.5, 5. ])

In [51]:
# pandas method: combine_first


b[:-2].combine_first(a[2:])

a    NaN
b    4.5
c    3.0
d    2.0
e    1.0
f    0.0
dtype: float64

In [54]:
print(b.combine_first(a))    # 如果a 为null，则选b,若同时真，则选b,若b为null,则选a
print('a : ')
print(a)
print("\nb : ")
print(b)

f    0.0
e    1.0
d    2.0
c    3.0
b    4.0
a    5.0
dtype: float64
a :
f    NaN
e    2.5
d    NaN
c    3.5
b    4.5
a    NaN
dtype: float64

b :
f    0.0
e    1.0
d    2.0
c    3.0
b    4.0
a    5.0
dtype: float64

In [55]:
# dataframe 类似，只不过是逐列进行比较和替换。
df1 = DataFrame({'a': [1., np.nan, 5., np.nan],
          'b': [np.nan, 2., np.nan, 6.],
          'c': range(2, 18, 4)})

df2 = DataFrame({'a': [5., 4., np.nan, 3., 7.],
          'b': [np.nan, 3., 4., 6., 8.]})

df1

     a    b   c
0  1.0  NaN   2
1  NaN  2.0   6
2  5.0  NaN  10
3  NaN  6.0  14

In [56]:
df2

     a    b
0  5.0  NaN
1  4.0  3.0
2  NaN  4.0
3  3.0  6.0
4  7.0  8.0

In [57]:
# 若对应的列或者行没有，则当作nan处理扩展即可。

df1.combine_first(df2)

     a    b     c
0  1.0  NaN   2.0
1  4.0  2.0   6.0
2  5.0  4.0  10.0
3  3.0  6.0  14.0
4  7.0  8.0   NaN

## Reshaping and Pivoting


重塑和旋转。 形状和？？？？


stack
This “rotates” or pivots from the columns in the data to the rows
从数据中的列喜欢转到行。


unstack
This pivots from the rows into the columns
与stack相反的操作。

### Reshaping with Hierarchical Indexing

In [60]:
# stack and unstack example:


data = DataFrame(np.arange(6).reshape(2,3), index= pd.Index(['Ohio','Colorado'], name = 'state'),
                 columns = pd.Index(['one','two','three'],name='number'))
data

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [62]:
result = data.stack()
result

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int64

In [64]:
result.unstack()
# reslut

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [66]:
result.unstack(level = 0) # 默认unstack的是最里边的，但是我们可以指定，最外边的。

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [67]:
# 或者直接指定level名
result.unstack('state')

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [69]:
data2 = pd.concat([s1, s2], keys=['one', 'two'])  # unstack 可能因为索引位置没有值而产生na值。

result2 = data2.unstack()
result2

       a    b    c    d    e
one  0.0  1.0  NaN  NaN  NaN
two  NaN  NaN  2.0  3.0  4.0

In [70]:
# 而 stack会自动过滤nan值。
result2.stack()

one  a    0.0
     b    1.0
two  c    2.0
     d    3.0
     e    4.0
dtype: float64

In [71]:
# 可以指定不丢弃null值。 
result2.stack(dropna=False)

one  a    0.0
     b    1.0
     c    NaN
     d    NaN
     e    NaN
two  a    NaN
     b    NaN
     c    2.0
     d    3.0
     e    4.0
dtype: float64

In [72]:
# dataframe unstack 后,相应的leve会自动便程最里边的level
df = pd.DataFrame({'left': result, 'right': result + 5},
columns=pd.Index(['left', 'right'], name='side'))
df

side             left  right
state    number
Ohio     one        0      5
         two        1      6
         three      2      7
Colorado one        3      8
         two        4      9
         three      5     10

In [73]:
df.unstack('state').stack('side') # 交换行列。

state         Colorado  Ohio
number side
one    left          3     0
       right         8     5
two    left          4     1
       right         9     6
three  left          5     2
       right        10     7

### Pivoting "Long" to "Wide" Format



A common way to store multiple time series in databases and CSV is in so-called long
or stacked format. Let’s load some example data and do a small amount of time series
wrangling and other data cleaning:

In [4]:
from google.colab import drive 
drive.mount('/content/drive/')

Go to this URL in a browser: https://accounts.google.com/o/oauth2/auth?client_id=947318989803-6bn6qk8qdgf4n4g3pfee6491hc0brc4i.apps.googleusercontent.com&redirect_uri=urn%3aietf%3awg%3aoauth%3a2.0%3aoob&scope=email%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdocs.test%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdrive%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdrive.photos.readonly%20https%3a%2f%2fwww.googleapis.com%2fauth%2fpeopleapi.readonly&response_type=code

Enter your authorization code:
··········
Mounted at /content/drive/

In [5]:
cd /content/drive/My Drive/examples

/content/drive/My Drive/examples

In [8]:
import pandas as pd
from pandas import Series
from pandas import DataFrame
import numpy as np
data = pd.read_csv('macrodata.csv')
data

       year  quarter    realgdp  realcons  ...  unemp      pop  infl  realint
0    1959.0      1.0   2710.349    1707.4  ...    5.8  177.146  0.00     0.00
1    1959.0      2.0   2778.801    1733.7  ...    5.1  177.830  2.34     0.74
2    1959.0      3.0   2775.488    1751.8  ...    5.3  178.657  2.74     1.09
3    1959.0      4.0   2785.204    1753.7  ...    5.6  179.386  0.27     4.06
4    1960.0      1.0   2847.699    1770.5  ...    5.2  180.007  2.31     1.19
..      ...      ...        ...       ...  ...    ...      ...   ...      ...
198  2008.0      3.0  13324.600    9267.7  ...    6.0  305.270 -3.16     4.33
199  2008.0      4.0  13141.920    9195.3  ...    6.9  305.952 -8.79     8.91
200  2009.0      1.0  12925.410    9209.2  ...    8.1  306.547  0.94    -0.71
201  2009.0      2.0  12901.504    9189.0  ...    9.2  307.226  3.37    -3.19
202  2009.0      3.0  12990.341    9256.0  ...    9.6  308.013  3.56    -3.44

[203 rows x 14 columns]

In [11]:
periods = pd.PeriodIndex(year=data.year, quarter=data.quarter, name='date')
periods  # quarter ：季度

PeriodIndex(['1959Q1', '1959Q2', '1959Q3', '1959Q4', '1960Q1', '1960Q2',
             '1960Q3', '1960Q4', '1961Q1', '1961Q2',
             ...
             '2007Q2', '2007Q3', '2007Q4', '2008Q1', '2008Q2', '2008Q3',
             '2008Q4', '2009Q1', '2009Q2', '2009Q3'],
            dtype='period[Q-DEC]', name='date', length=203, freq='Q-DEC')

In [12]:
columns = pd.Index(['realgd', 'infl', 'unemp'], name='item')
columns

Index(['realgd', 'infl', 'unemp'], dtype='object', name='item')

In [14]:
data = data.reindex(columns = columns)
data

item  realgd  infl  unemp
0        NaN  0.00    5.8
1        NaN  2.34    5.1
2        NaN  2.74    5.3
3        NaN  0.27    5.6
4        NaN  2.31    5.2
..       ...   ...    ...
198      NaN -3.16    6.0
199      NaN -8.79    6.9
200      NaN  0.94    8.1
201      NaN  3.37    9.2
202      NaN  3.56    9.6

[203 rows x 3 columns]

In [37]:
data.index = periods.to_timestamp('D') # 添加index。为时间序列。 将periods 这种季度表示的时间转换成日期表示的时间。

data

item        realgd  infl  unemp
date
1959-01-01     NaN  0.00    5.8
1959-04-01     NaN  2.34    5.1
1959-07-01     NaN  2.74    5.3
1959-10-01     NaN  0.27    5.6
1960-01-01     NaN  2.31    5.2
...            ...   ...    ...
2008-07-01     NaN -3.16    6.0
2008-10-01     NaN -8.79    6.9
2009-01-01     NaN  0.94    8.1
2009-04-01     NaN  3.37    9.2
2009-07-01     NaN  3.56    9.6

[203 rows x 3 columns]

In [27]:
ldata = data.stack().reset_index().rename(columns ={0: 'value'})   # 将date转为column。
ldata

                             date   item  value
0   1959-03-31 23:59:59.999999999   infl   0.00
1   1959-03-31 23:59:59.999999999  unemp   5.80
2   1959-06-30 23:59:59.999999999   infl   2.34
3   1959-06-30 23:59:59.999999999  unemp   5.10
4   1959-09-30 23:59:59.999999999   infl   2.74
..                            ...    ...    ...
401 2009-03-31 23:59:59.999999999  unemp   8.10
402 2009-06-30 23:59:59.999999999   infl   3.37
403 2009-06-30 23:59:59.999999999  unemp   9.20
404 2009-09-30 23:59:59.999999999   infl   3.56
405 2009-09-30 23:59:59.999999999  unemp   9.60

[406 rows x 3 columns]

In [30]:
pivoted = ldata.pivot('date', 'item', 'value')  # data 为行索引，item为列索引，value进行dataframe 的value填充。
pivoted

item                           infl  unemp
date
1959-03-31 23:59:59.999999999  0.00    5.8
1959-06-30 23:59:59.999999999  2.34    5.1
1959-09-30 23:59:59.999999999  2.74    5.3
1959-12-31 23:59:59.999999999  0.27    5.6
1960-03-31 23:59:59.999999999  2.31    5.2
...                             ...    ...
2008-09-30 23:59:59.999999999 -3.16    6.0
2008-12-31 23:59:59.999999999 -8.79    6.9
2009-03-31 23:59:59.999999999  0.94    8.1
2009-06-30 23:59:59.999999999  3.37    9.2
2009-09-30 23:59:59.999999999  3.56    9.6

[203 rows x 2 columns]

In [29]:
ldata['value2'] = np.random.randn(len(ldata))
ldata[:10]

                           date   item  value    value2
0 1959-03-31 23:59:59.999999999   infl   0.00 -0.082108
1 1959-03-31 23:59:59.999999999  unemp   5.80  0.566715
2 1959-06-30 23:59:59.999999999   infl   2.34 -0.153061
3 1959-06-30 23:59:59.999999999  unemp   5.10 -0.779180
4 1959-09-30 23:59:59.999999999   infl   2.74  1.609608
5 1959-09-30 23:59:59.999999999  unemp   5.30  0.130882
6 1959-12-31 23:59:59.999999999   infl   0.27  0.491816
7 1959-12-31 23:59:59.999999999  unemp   5.60  0.457245
8 1960-03-31 23:59:59.999999999   infl   2.31 -0.927752
9 1960-03-31 23:59:59.999999999  unemp   5.20 -0.329000

In [33]:
# 现在value有了两个值，该怎么办？
ldata.pivot(index = 'date', columns='item') # 直接省略value1，2

                              value          value2
item                           infl unemp      infl     unemp
date
1959-03-31 23:59:59.999999999  0.00   5.8 -0.082108  0.566715
1959-06-30 23:59:59.999999999  2.34   5.1 -0.153061 -0.779180
1959-09-30 23:59:59.999999999  2.74   5.3  1.609608  0.130882
1959-12-31 23:59:59.999999999  0.27   5.6  0.491816  0.457245
1960-03-31 23:59:59.999999999  2.31   5.2 -0.927752 -0.329000
...                             ...   ...       ...       ...
2008-09-30 23:59:59.999999999 -3.16   6.0 -0.779462 -0.170769
2008-12-31 23:59:59.999999999 -8.79   6.9  0.341708  0.203223
2009-03-31 23:59:59.999999999  0.94   8.1 -0.306913  0.627373
2009-06-30 23:59:59.999999999  3.37   9.2  1.695690  0.834749
2009-09-30 23:59:59.999999999  3.56   9.6  0.432911  1.379431

[203 rows x 4 columns]

In [36]:
# 这种操作其实用unstack和set_index也可以做到。

unstacked = ldata.set_index(['date','item']).unstack('item')
unstacked

                              value          value2
item                           infl unemp      infl     unemp
date
1959-03-31 23:59:59.999999999  0.00   5.8 -0.082108  0.566715
1959-06-30 23:59:59.999999999  2.34   5.1 -0.153061 -0.779180
1959-09-30 23:59:59.999999999  2.74   5.3  1.609608  0.130882
1959-12-31 23:59:59.999999999  0.27   5.6  0.491816  0.457245
1960-03-31 23:59:59.999999999  2.31   5.2 -0.927752 -0.329000
...                             ...   ...       ...       ...
2008-09-30 23:59:59.999999999 -3.16   6.0 -0.779462 -0.170769
2008-12-31 23:59:59.999999999 -8.79   6.9  0.341708  0.203223
2009-03-31 23:59:59.999999999  0.94   8.1 -0.306913  0.627373
2009-06-30 23:59:59.999999999  3.37   9.2  1.695690  0.834749
2009-09-30 23:59:59.999999999  3.56   9.6  0.432911  1.379431

[203 rows x 4 columns]

### Pivoting "Wide" to "Long" Format

与pivot 相反， melt 将短dataframe 转变成长的dataframe.

In [39]:
df = pd.DataFrame({'key': ['foo', 'bar', 'baz'],
            'A': [1, 2, 3],
            'B': [4, 5, 6],
            'C': [7, 8, 9]})
df

   key  A  B  C
0  foo  1  4  7
1  bar  2  5  8
2  baz  3  6  9

In [40]:
melted = pd.melt(df, ['key'])
melted

   key variable  value
0  foo        A      1
1  bar        A      2
2  baz        A      3
3  foo        B      4
4  bar        B      5
5  baz        B      6
6  foo        C      7
7  bar        C      8
8  baz        C      9

In [42]:
# use pivot convert it .
reshaped = melted.pivot('key', 'variable', 'value')
reshaped

variable  A  B  C
key
bar       2  5  8
baz       3  6  9
foo       1  4  7

In [43]:
reshaped.reset_index()

variable  key  A  B  C
0         bar  2  5  8
1         baz  3  6  9
2         foo  1  4  7

In [47]:
# pd.melt? # 从宽到长的数据格式。 pivot 则是从到宽的数据格式。


pd.melt(df, value_vars=['A','B','C'], value_name='fuck')

  variable  fuck
0        A     1
1        A     2
2        A     3
3        B     4
4        B     5
5        B     6
6        C     7
7        C     8
8        C     9

In [46]:
pd.melt(df,value_vars=['key', 'A','B'])

  variable value
0      key   foo
1      key   bar
2      key   baz
3        A     1
4        A     2
5        A     3
6        B     4
7        B     5
8        B     6